In [2]:
from sqlalchemy import create_engine, text

In [3]:
database_name = 'scooters'

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [4]:
engine = create_engine(connection_string)

In [30]:
query = '''
SELECT *
FROM trips
LIMIT 500000;
'''

with engine.connect() as connection:
    result = connection.execute(text(query))

In [23]:
result.fetchone()

(datetime.datetime(2019, 7, 6, 21, 55, 49, 840000), 'Lime', 'LIM792779', 'PoweredLCGAGM7XUUZCI', Decimal('44.0'), Decimal('6312.6973319874'), datetime.date(2019, 7, 6), datetime.time(20, 41, 6), datetime.date(2019, 7, 6), datetime.time(21, 25, 32), Decimal('36.160289'), Decimal('-86.774963'), Decimal('36.156436'), Decimal('-86.776062'), '[(36.16148, -86.77598), (36.16128, -86.77665), (36.16103, -86.77703000000001), (36.16113, -86.77702000000001), (36.16102, -86.77711000000001), (36.16 ... (1101 characters truncated) ...  -86.77585), (36.15629999999999, -86.77585), (36.15618999999999, -86.77644000000001), (36.15643999999999, -86.77606), (36.15814999999999, -86.77715)]', datetime.datetime(2019, 7, 7, 9, 0, 46, 243000))

In [24]:
import pandas as pd

In [31]:
with engine.connect() as connection:
    trips = pd.read_sql(text(query), con = connection)

trips.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-06-27 21:19:28.397,Bird,BRD2104,PoweredLLJ8U,10.000000,0.00000,2019-06-27,21:11:54.870000,2019-06-27,21:21:25.306666,36.159300,-86.774800,36.161700,-86.776000,"[(36.15936, -86.774792), (36.15921, -86.77492)...",2019-06-28 05:31:33.110
1,2019-06-27 21:19:28.397,Bird,BRD2102,PoweredMAINC,5.000000,0.00000,2019-06-27,21:16:30.063333,2019-06-27,21:21:19.950000,36.146800,-86.799400,36.146800,-86.799400,"[(36.146875, -86.79939)]",2019-06-28 05:31:33.043
2,2019-06-27 21:19:28.397,Bird,BRD2105,PoweredS3KLU,10.000000,0.00000,2019-06-27,21:11:11.593333,2019-06-27,21:21:24.633333,36.159300,-86.774800,36.161100,-86.776400,"[(36.159316, -86.774727), (36.159206, -86.7748...",2019-06-28 05:31:33.140
3,2019-06-27 21:20:22.240,SPIN,SPI204,Powered8771686,4.000000,3126.64052,2019-06-27,21:12:19,2019-06-27,21:15:35,36.163113,-86.780431,36.158806,-86.789607,"[(36.158806127529736, -86.78960736849046), (36...",2019-06-28 10:05:50.790
4,2019-06-27 21:20:31.937,Lyft,LFT715,Powered305510,10.338733,5964.56712,2019-06-27,21:10:11.496666,2019-06-27,21:20:31.820000,36.162030,-86.775410,36.171610,-86.764970,"[(36.16203, -86.77541), (36.16214, -86.7754), ...",2019-06-28 09:22:20.790

In [26]:
# with engine.connect() as connection:
#     scooters = pd.read_sql(text(query), con = connection)

# scooters.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-07-07 00:39:27.920,Bird,BRD8065,PoweredS8MH8,5.0,0.000,2019-07-07,00:34:41.936666,2019-07-07,00:39:35.996666,36.1451,-86.8096,36.1437,-86.8084,"[(36.145152, -86.809527), (36.145103, -86.8094...",2019-07-08 05:30:22.280
1,2019-07-07 00:39:27.920,Bird,BRD8069,Powered1NNHR,10.0,0.000,2019-07-07,00:30:44.306666,2019-07-07,00:40:39.323333,36.1607,-86.7750,36.1604,-86.7767,"[(36.1607, -86.774911), (36.160748, -86.775019...",2019-07-08 05:30:22.400
2,2019-07-07 00:39:27.920,Bird,BRD8082,PoweredF3JTT,44.0,0.000,2019-07-06,23:55:05.710000,2019-07-07,00:39:34.890000,36.1492,-86.7933,36.1521,-86.7930,"[(36.149292, -86.793272), (36.149699, -86.7934...",2019-07-08 05:30:22.790
3,2019-07-07 00:39:27.920,Bird,BRD8078,PoweredUFW4X,29.0,3937.008,2019-07-07,00:11:47.850000,2019-07-07,00:41:10.590000,36.1610,-86.7735,36.1601,-86.7790,"[(36.160995, -86.773478), (36.160881, -86.7735...",2019-07-08 05:30:22.670
4,2019-07-07 00:39:27.920,Bird,BRD8057,PoweredZU51C,0.0,0.000,2019-07-07,00:40:38.016666,2019-07-07,00:40:47.973333,36.1645,-86.7768,36.1645,-86.7768,"[(36.164588, -86.776728)]",2019-07-08 05:30:22.040

In [32]:
trips.tail()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
499995,2019-06-15 21:52:47.547,Lime,LIM3220,PoweredFN6BVSKAZILY3,8.916667,2618.0784,2019-06-15,21:38:44,2019-06-15,21:47:39,36.171974,-86.785819,36.176611,-86.785290,"[(36.17197, -86.78582), (36.17193, -86.78583),...",2019-06-16 08:15:41.527
499996,2019-06-15 21:52:47.547,Lime,LIM3221,PoweredC5M42FEH36NYJ,10.966667,2647.6056,2019-06-15,21:36:42,2019-06-15,21:47:40,36.171999,-86.785794,36.176143,-86.785473,"[(36.172, -86.78579), (36.17196, -86.785810000...",2019-06-16 08:15:41.560
499997,2019-06-15 21:52:47.547,Lime,LIM3217,PoweredG6KIN4B3XCNVT,5.750000,2099.7120,2019-06-15,21:41:09,2019-06-15,21:46:54,36.149508,-86.793386,36.152650,-86.790335,"[(36.14951, -86.79339), (36.14996, -86.7934), ...",2019-06-16 08:15:41.430
499998,2019-06-15 21:53:04.540,Lyft,LFT2028,Powered429352,14.547883,7496.7194,2019-06-15,21:38:31.540000,2019-06-15,21:53:04.413333,36.160640,-86.778180,36.149660,-86.797260,"[(36.16064, -86.77818), (36.16066, -86.77823),...",2019-06-16 08:56:23.377
499999,2019-06-15 21:52:47.547,Lime,LIM3218,PoweredVPMK24SWEM66S,31.300000,9602.9016,2019-06-15,21:15:46,2019-06-15,21:47:04,36.160396,-86.777012,36.155939,-86.774239,"[(36.1604, -86.77701), (36.15997, -86.77653000...",2019-06-16 08:15:41.460

In [33]:
trips.info()
# We have a large enough sample to assume the trips table is free or relatively free of null values.
# Just querying trips for now. Scooters may be different.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500000 entries, 0 to 499999
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   pubtimestamp    500000 non-null  datetime64[ns]
 1   companyname     500000 non-null  object
 2   triprecordnum   500000 non-null  object
 3   sumdid          500000 non-null  object
 4   tripduration    500000 non-null  float64
 5   tripdistance    500000 non-null  float64
 6   startdate       500000 non-null  object
 7   starttime       500000 non-null  object
 8   enddate         500000 non-null  object
 9   endtime         500000 non-null  object
 10  startlatitude   500000 non-null  float64
 11  startlongitude  500000 non-null  float64
 12  endlatitude     500000 non-null  float64
 13  endlongitude    500000 non-null  float64
 14  triproute       500000 non-null  object
 15  create_dt       500000 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(6), object(8)
memory usage: 61.0+ MB

In [37]:
query = '''
SELECT *
FROM scooters
LIMIT 500000;
'''

with engine.connect() as connection:
    scooters = pd.read_sql(text(query), con = connection)

In [38]:
scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500000 entries, 0 to 499999
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   pubdatetime  500000 non-null  datetime64[ns]
 1   latitude     500000 non-null  float64
 2   longitude    500000 non-null  float64
 3   sumdid       500000 non-null  object
 4   sumdtype     500000 non-null  object
 5   chargelevel  500000 non-null  float64
 6   sumdgroup    500000 non-null  object
 7   costpermin   500000 non-null  float64
 8   companyname  500000 non-null  object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 34.3+ MB

In [ ]:
# SCOOTERS TABLE - New columns/values

# we need:
# pubdatetime, latitude, longitude, sumdid, companyname

# cut out:
# sumdtype, chargelevel, costpermin

# filter:
# sumdgroup (only "scooter" values)

In [ ]:
# TRIPS TABLE - smaller table, and less to cut. We're deciding to keep everything for now.

In [54]:
query_lite = '''
SELECT pubdatetime, latitude, longitude, sumdid, companyname
FROM scooters
WHERE sumdgroup iLIKE 'scooter'
LIMIT 1600000;
'''

with engine.connect() as connection:
    scooters_lite = pd.read_sql(text(query_lite), con = connection)

In [55]:
# Between 1.6 million and 1.7 million, we lose the non-null count information.
scooters_lite.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1600000 entries, 0 to 1599999
Data columns (total 5 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   pubdatetime  1600000 non-null  datetime64[ns]
 1   latitude     1600000 non-null  float64
 2   longitude    1600000 non-null  float64
 3   sumdid       1600000 non-null  object
 4   companyname  1600000 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 61.0+ MB

In [58]:
# scooters_lite has no null values
sl_null_query = '''
SELECT COUNT (*)
FROM scooters
WHERE pubdatetime IS NULL
    OR latitude IS NULL
    OR longitude IS NULL
    OR sumdid IS NULL
    OR companyname IS NULL;
'''

pd.read_sql(sl_null_query, con = engine)

   count
0      0

In [59]:
trips.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-06-27 21:19:28.397,Bird,BRD2104,PoweredLLJ8U,10.000000,0.00000,2019-06-27,21:11:54.870000,2019-06-27,21:21:25.306666,36.159300,-86.774800,36.161700,-86.776000,"[(36.15936, -86.774792), (36.15921, -86.77492)...",2019-06-28 05:31:33.110
1,2019-06-27 21:19:28.397,Bird,BRD2102,PoweredMAINC,5.000000,0.00000,2019-06-27,21:16:30.063333,2019-06-27,21:21:19.950000,36.146800,-86.799400,36.146800,-86.799400,"[(36.146875, -86.79939)]",2019-06-28 05:31:33.043
2,2019-06-27 21:19:28.397,Bird,BRD2105,PoweredS3KLU,10.000000,0.00000,2019-06-27,21:11:11.593333,2019-06-27,21:21:24.633333,36.159300,-86.774800,36.161100,-86.776400,"[(36.159316, -86.774727), (36.159206, -86.7748...",2019-06-28 05:31:33.140
3,2019-06-27 21:20:22.240,SPIN,SPI204,Powered8771686,4.000000,3126.64052,2019-06-27,21:12:19,2019-06-27,21:15:35,36.163113,-86.780431,36.158806,-86.789607,"[(36.158806127529736, -86.78960736849046), (36...",2019-06-28 10:05:50.790
4,2019-06-27 21:20:31.937,Lyft,LFT715,Powered305510,10.338733,5964.56712,2019-06-27,21:10:11.496666,2019-06-27,21:20:31.820000,36.162030,-86.775410,36.171610,-86.764970,"[(36.16203, -86.77541), (36.16214, -86.7754), ...",2019-06-28 09:22:20.790

In [67]:
query_time_difference = '''
SELECT MIN (startdate) AS min_startdate, 
MAX (startdate) AS max_startdate,
MIN (enddate) AS min_enddate,
MAX (enddate) AS max_enddate
FROM trips
'''
pd.read_sql(query_time_difference, con = engine)

  min_startdate max_startdate min_enddate max_enddate
0    2019-05-01    2019-07-31  2019-05-01  2019-08-01

In [68]:
query_time_difference_scooters = '''
SELECT MIN (pubdatetime) AS min_pubdate, MAX (pubdatetime) AS max_pubdate
FROM scooters
'''
pd.read_sql(query_time_difference_scooters, con = engine)

              min_pubdate         max_pubdate
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [69]:
query_distinct_sumdgroup = '''
SELECT DISTINCT sumdgroup
FROM scooters
'''
pd.read_sql(query_distinct_sumdgroup, con = engine)

# We've filtered out bicycle values in scooters_lite, since we're only looking into scooters.

  sumdgroup
0   bicycle
1   scooter
2   Scooter

In [77]:
query_lat_long_trips = '''
SELECT MIN (startlatitude) AS min_startlatitude, 
 MAX (startlatitude) AS max_startlatitude, 
 MIN (startlongitude) AS min_startlongitude, 
 MAX (startlongitude) AS max_startlongitude,
 MIN (endlatitude) AS min_endlatitude,
 MAX (endlatitude) AS max_endlatitude, 
 MIN (endlongitude) AS min_endlongitude,
 MAX (endlatitude) AS max_endlatitude
FROM trips
'''
pd.read_sql(query_lat_long_trips, con = engine)

,min_startlatitude,max_startlatitude,min_startlongitude,max_startlongitude,min_endlatitude,max_endlatitude,min_endlongitude,max_endlatitude
0,35.8532,36.300029,-86.918008,-86.3662,-36.850405,51.045409,-122.673729,51.045409

The last three values are outside of Nashville. We may want to filter out outliers in latitude/longitude or account for these values in some way.

What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [78]:
query_trip_duration_distance = '''
SELECT MIN (tripduration) AS min_tripduration, 
 MAX (tripduration) AS max_tripduration, 
 MIN (tripdistance) AS min_tripdistance, 
 MAX (tripdistance) AS max_tripdistance
FROM trips
'''
pd.read_sql(query_trip_duration_distance, con = engine)

   min_tripduration  max_tripduration  min_tripdistance  max_tripdistance
0        -19.358267          512619.0       -20324803.8      3.188448e+07

Trip duration is in minutes, and trip distance is in feet.